[
  {
    "Player": "David Johnson ARI (9)",
    "BallersRank": 1,
    "ADP": 1.05,
    "Projected Pts.": 222.03,
    "Risk": 4.83,
    "Tier": "TIER 1",
    "Vid": "",
    "Notes": "The savior for several fantasy players last year. Johnson showed major potential, albeit in a very small sample size. That coaching staff has verbally committed to DJ as the 3-down back for the high powered AZ offense, but we haven't seen it. He will cost a first round pick, looks tremendous on paper, but carries a usage risk."
  },
  {
    "Player": "Todd Gurley LA (8)",
    "BallersRank": 2,
    "ADP": 1.04,
    "Projected Pts.": 224.3,
    "Risk": 3.33,
    "Tier": "TIER 1",
    "Vid": "",
    "Notes": "As soon as he got on the field, Gurley was everything that fantasy players thought he could be. A punishing RB in a run first offense. He does have some potential limitations as he wasn't featured in the passing game. But as far as workload and touchdown potential, it's hard to get better than Gurley."
  },
  {
    "Player": "Jamaal Charles KC (5)",
    "BallersRank": 3,
    "ADP": 2.03,
    "Projected Pts.": 212.97,
    "Risk": 5.07,
    "Tier": "TIER 1",
    "Vid": "",
    "Notes": "Another ACL tear for Mr. 5.0 YPC. The red flags here are real and justified given the age, injury history, and draft equity it will take to get Charles. But we believe he can come back and continue to be a fantasy stud. The KC backups (West/Ware) showed they were capable, so expect Charles to be given more sideline time than usual. Charles is still among the top fantasy options."
  },
  {
    "Player": "Adrian Peterson MIN (6)",
    "BallersRank": 4,
    "ADP": 1.06,
    "Projected Pts.": 212.67,
    "Risk": 2.17,
    "Tier": "TIER 1",
    "Vid": "",
    "Notes": "The machine. If Peterson is in uniform, nothing is going to stop him from being a fantasy stud. Aside from the suspension year, Peterson has never had less than double-digit touchdowns. He doesn't provide much in the passing game, but the Vikings are committed to him. The looming threat of Father Time is the only negative for AP."
  },
  {
    "Player": "Lamar Miller HOU (9)",
    "BallersRank": 5,
    "ADP": 1.09,
    "Projected Pts.": 207.03,
    "Risk": 4.2,
    "Tier": "TIER 2",
    "Vid": "",
    "Notes": "#FreeLamar! We did it America! Miller is going to get his chance to be a fully featured running back. Several coaching staffs were convinced that Miller shouldn't have that responsibility. Time to find out if Bill O'Brien is smarter than those previous Dolphin coaches (spoiler alert, we think he is)."
  },
  {
    "Player": "Ezekiel Elliott DAL (7)",
    "BallersRank": 6,
    "ADP": 1.09,
    "Projected Pts.": 201.43,
    "Risk": 3.37,
    "Tier": "TIER 2",
    "Vid": "",
    "Notes": "Start the engines for they hype train! The Cowboys went all in on their guy EZ-E with the 4th overall pick. Teams aren't going to take a RB that high to sit and learn for a few games. It's trial by combat for Elliott. Lucky for him, he gets to run behind the best offensive line in the NFL and get the ball handed to him by one of the better QBs in the league. Elliott will make his way into the 1st round in redraft leagues, perhaps an overpayment, but not everyone comes into the league with the potential to finish as a top-3 fantasy RB."
  },
  {
    "Player": "Le'Veon Bell PIT (8)",
    "BallersRank": 7,
    "ADP": 1.11,
    "Projected Pts.": 205.44,
    "Risk": 4.73,
    "Tier": "TIER 2",
    "Vid": "",
    "Notes": "Currently looking at a 3 game suspension, Bell is a tough decision now for fantasy players. He's likely still worth a 2nd round value. The last 2 seasons have ended from a major knee injury, so grabbing Lev does come with some risk. But there isn't an RB in fantasy drafts that can match his production and workload."
  },
  {
    "Player": "LeSean McCoy BUF (10)",
    "BallersRank": 8,
    "ADP": 2.08,
    "Projected Pts.": 200.23,
    "Risk": 3.43,
    "Tier": "TIER 2",
    "Vid": "",
    "Notes": "Shady McCoy had a shakeup with the Law that put a fright into keeper and dynasty players. As of now, it appears he won't face any punitive response for the incident in the nightclub. We've been high on Shady all summer, but now with news of Karlos Williams suspension, his draft stock might raise a bit too high. He's still a bell cow running back for a running team and shouldn't cost you a 1st or 2nd round pick."
  },
  {
    "Player": "Mark Ingram NO (5)",
    "BallersRank": 9,
    "ADP": 2.1,
    "Projected Pts.": 195.5,
    "Risk": 2.5,
    "Tier": "TIER 2",
    "Vid": "",
    "Notes": "If someone had told you Mark Ingram would have 50 receptions in 12 games, the year the Saints signed C.J. Spiller, you would have likely laughed in their face. Seemingly overnight, Ingram became ultra reliable as a 3-down running back. There is the chance he doesn't retain that role as much this year, but if he does, he becomes one of the safest RBs in fantasy (aside from injury of course)."
  },
  {
    "Player": "Doug Martin TB (6)",
    "BallersRank": 10,
    "ADP": 2.12,
    "Projected Pts.": 193.2,
    "Risk": 4,
    "Tier": "TIER 2",
    "Vid": "",
    "Notes": "Well, well, well. Mr. Martin returned to top form in a big way. He finished 2nd in the league in rushing yards and sported a monstrous 4.9 YPC average. He was rewarded with a new contract from Tampa and returns to a budding offense. It should be remembered between his productive years are 2 horrifically bad years. The nice thing is Martin shouldn't cost a first round pick and provides nice upside for an RB in the 2nd round."
  },
  {
    "Player": "Eddie Lacy GB (4)",
    "BallersRank": 11,
    "ADP": 2.05,
    "Projected Pts.": 186.33,
    "Risk": 4.73,
    "Tier": "TIER 2",
    "Vid": "",
    "Notes": "Eddie Lacy went down as a major bust last year. He clearly did not give his all nor devote his offseason to improving his game. Send in our hero Tony Horton of P90X fame to transform Eddie Lacy, into Eddie Money! Looking to cash in on a contract year, expect a sculpted Lacy to show up and be what fantasy players became accustomed to in his first two seasons."
  },
  {
    "Player": "Devonta Freeman ATL (11)",
    "BallersRank": 12,
    "ADP": 2.06,
    "Projected Pts.": 182.17,
    "Risk": 5.9,
    "Tier": "TIER 2",
    "Vid": "",
    "Notes": "Freeman didn't earn the starter role out of training camp. But, when he was handed the 3-down role, he dug in like the talons of a...well..falcon. Finishing as the overall no.1 fantasy RB, Freeman was high volume and especially productive in the passing game. Tevin Coleman still lurks in the shadows, but it would be surprising to see the workload shift away from Freeman at this point."
  },
  {
    "Player": "Latavius Murray OAK (10)",
    "BallersRank": 13,
    "ADP": 3.09,
    "Projected Pts.": 175.5,
    "Risk": 4.83,
    "Tier": "TIER 3",
    "Vid": "",
    "Notes": "The Raiders repeatedly said with words and actions they wanted to bring in 'help' for Latavius. That help came in the form of Deandre Washington, who is not physically built to be a 3-down RB. So it would appear that Murray is safe to be the lead dog in an evolving offense. Murray has the ability and is looking at a workload to be fantasy star again."
  },
  {
    "Player": "Ryan Mathews PHI (4)",
    "BallersRank": 14,
    "ADP": 5.09,
    "Projected Pts.": 167.47,
    "Risk": 4.8,
    "Tier": "TIER 3",
    "Vid": "",
    "Notes": "A guy we feel is being underrated by the community. The Eagles were rumored to be connected to EZ-E, but they decided to trade all of this year and next year's picks to move up for Carson Wentz. This took them out of the RB game. The only RB they added, Wendell Smallwood, is viewed as a scatback. If new coach Doug Pederson runs anything similar to the Chiefs offense, Mathews is looking at heavy involvement. Hopefully his adamantium surgery got scheduled."
  },
  {
    "Player": "Thomas Rawls SEA (5)",
    "BallersRank": 15,
    "ADP": 3.06,
    "Projected Pts.": 163.3,
    "Risk": 6.2,
    "Tier": "TIER 3",
    "Vid": "",
    "Notes": "The NFL draft wasn't as kind to Rawls as it could have been. Over the offseason, Rawls was thought to be the heir to BeastMode. But the Seahawks invested a few draft picks in C.J. Prosise and Alex Collins. And Christine Michael has had a #Awakening according the coaching staff and our eyeballs watching him in the preseason. Rawls is shaping up as a very high risk pick in the 3rd, but if he can replicate last season, that's a pretty delicious reward."
  },
  {
    "Player": "C.J. Anderson DEN (11)",
    "BallersRank": 16,
    "ADP": 3.07,
    "Projected Pts.": 165.97,
    "Risk": 5.9,
    "Tier": "TIER 3",
    "Vid": "",
    "Notes": "The ultra-polarizing C.J. Anderson. He was all set to leave Denver until the team had second thoughts and matched a lucrative contract. He burned a ton of fantasy players last year. All signs point to Denver running the ball a ton and Anderson being the main ball carrier. The epitome of high risk/high reward."
  },
  {
    "Player": "Jonathan Stewart CAR (7)",
    "BallersRank": 16,
    "ADP": 4.1,
    "Projected Pts.": 164.1,
    "Risk": 4.03,
    "Tier": "TIER 3",
    "Vid": "",
    "Notes": "Jonathan Stewart hadn't seen the type of workload he had in 2015, well, ever. He wasn't ever a flashy player for fantasy players, his ceiling is capped by the ultimate goal line vulture Cam Newton. However, 8 straight weeks of 20+ carries cannot be ignored. Sometimes your team needs those low ceiling/high floor guys."
  },
  {
    "Player": "Jeremy Hill CIN (9)",
    "BallersRank": 18,
    "ADP": 4.07,
    "Projected Pts.": 161.1,
    "Risk": 4.87,
    "Tier": "TIER 3",
    "Vid": "",
    "Notes": "Hill was close to a major disaster last year. Luckily he finished the year tied for the most rushing touchdowns. Hill didn't look anything like his rookie year, often dancing and indecisive. He is still the goal line back on a solid offense, but will be rightfully hard to trust. Look for a year better than last, but not as good as his rookie year."
  },
  {
    "Player": "Carlos Hyde SF (8)",
    "BallersRank": 19,
    "ADP": 4.02,
    "Projected Pts.": 160.3,
    "Risk": 5.07,
    "Tier": "TIER 3",
    "Vid": "",
    "Notes": "That Week 1 breakout on primetime seems like a REALLY long time ago. Hyde dealt with injuries and an abysmal team for all of 2015. Chip Kelly has come to town, bringing an offense that leads to fantasy production for RBs. If Hyde can hold up, and that's a big IF, he's looking at a very high volume workload."
  },
  {
    "Player": "DeMarco Murray TEN (13)",
    "BallersRank": 19,
    "ADP": 4.01,
    "Projected Pts.": 157.87,
    "Risk": 3.67,
    "Tier": "TIER 3",
    "Vid": "",
    "Notes": "DeMarco was sent packing to the Titans early in the offseason. It wasn't an ideal landing spot as far as high scoring offense, but he was setup for a 250+ carry season. Was being the key word. The Titans grabbed Derrick Henry with a 2nd round pick. Murray is still likely to be the primary ball carrier, but his volume took a major blow."
  },
  {
    "Player": "Jeremy Langford CHI (9)",
    "BallersRank": 21,
    "ADP": 4.09,
    "Projected Pts.": 152.03,
    "Risk": 6.9,
    "Tier": "TIER 4",
    "Vid": "",
    "Notes": "The tape is lacking, but the opportunity won't be. Langford volumed his way to a stretch of fantasy awesomeness last year while Matt Forte was injured. The Bears did add Jordan Howard in the draft, and some see him as a workload threat. As of now, Langford is set to prove that opportunity can can outweigh talent for fantasy."
  },
  {
    "Player": "Matt Forte NYJ (11)",
    "BallersRank": 22,
    "ADP": 4.04,
    "Projected Pts.": 150.03,
    "Risk": 6.03,
    "Tier": "TIER 4",
    "Vid": "",
    "Notes": "Chicago told Forte to hit the bricks. The Jets were there with open arms to embrace the veteran. Then they opened their arms to Bilal Powell and Khiry Robinson creating a crowded backfield. Forte has red flags all over, age/workload/new team late in career, but has been one of the most efficient running backs for years. His draft cost helps mitigate some of the risk, but the reward could be huge."
  },
  {
    "Player": "Frank Gore IND (10)",
    "BallersRank": 23,
    "ADP": 6.06,
    "Projected Pts.": 149.53,
    "Risk": 3.13,
    "Tier": "TIER 4",
    "Vid": "",
    "Notes": "Frank Gore finished last year as an RB1...Yes, that Frank Gore. The good news is Andrew Luck will be ready for the season and Gore has little to no competition, looking at you Robert Turbin. The hype surrounding Gore will be far less this year, despite finishing as RB12 last year. Looks like a real value."
  },
  {
    "Player": "Melvin Gordon SD (11)",
    "BallersRank": 24,
    "ADP": 5.09,
    "Projected Pts.": 149.3,
    "Risk": 5.37,
    "Tier": "TIER 4",
    "Vid": "",
    "Notes": "Looking like a superhuman returning from his knee surgery, Gordon looked quite healthy on a huge catch and run that turned into a TD in preseason Week 1. There could be life yet in the second year player. The best part of Gordon is the draft day discount players can have. He's not a lock to return or breakout, but for the price, the upside is worth it."
  },
  {
    "Player": "Matt Jones WAS (9)",
    "BallersRank": 25,
    "ADP": 5.11,
    "Projected Pts.": 147.27,
    "Risk": 5,
    "Tier": "TIER 4",
    "Vid": "",
    "Notes": "Jones was bad. Real bad last year. Between his occasional highlight plays were numerous plays of inefficiency. But, knock knock says Opportunity. Alfred Morris is gone and Jones is being talked up like a true workhorse RB. He has the catching chops to do it, but the draft cost for him will cause him to be a risk. He's also dealing with an AC sprain and won't be seen again until Week 1."
  },
  {
    "Player": "Giovani Bernard CIN (9)",
    "BallersRank": 26,
    "ADP": 7.04,
    "Projected Pts.": 141.5,
    "Risk": 2.7,
    "Tier": "TIER 4",
    "Vid": "",
    "Notes": "Gio had a strange season last year. He came out magma hot, capitalizing on the slow start of Jeremy Hill. But then his usage became erratic and couldn't really be counted on. Gio is a PPR stud and is solid for Standard as well. Lots of owners get scared off of true timeshare RBs, use their fear to get a great fantasy player."
  },
  {
    "Player": "Arian Foster MIA (8)",
    "BallersRank": 27,
    "ADP": 5.06,
    "Projected Pts.": 143.53,
    "Risk": 7.73,
    "Tier": "TIER 4",
    "Vid": "",
    "Notes": "Arian Foster has swapped teams with Lamar Miller and is taking his talents to Miami. This throws quite the wrench in Jay Ajayi and Kenyan Drake's value, but the question is, what can Foster do? Will he be the Gase-led veteran star like Knowshon Moreno was? Will he be a worthless veteran leader like Steven Jackson was in Atl? The truth will probably be in between. At age 30, coming off of a very difficult injury, switching teams, and a slew of other reasons lead us to believe he will be much closer to Steven Jackson."
  },
  {
    "Player": "Isaiah Crowell CLE (13)",
    "BallersRank": 27,
    "ADP": 9.05,
    "Projected Pts.": 139.93,
    "Risk": 2.93,
    "Tier": "TIER 4",
    "Vid": "",
    "Notes": "Don't give up on Crowell! Hue Jackson has worked magic with a handful of RBs. The Browns seem content to let Crowell and Duke Johnson handle the backfield. His upside is limited to being a 2-down thumper, but there's nothing wrong with that in the place he will be drafted."
  },
  {
    "Player": "Danny Woodhead SD (11)",
    "BallersRank": 29,
    "ADP": 8.01,
    "Projected Pts.": 136,
    "Risk": 3.63,
    "Tier": "TIER 5",
    "Vid": "",
    "Notes": "Always undervalued and underrated for fantasy. Woodhead could possibly be even more involved now with his teammate Melvin Gordon coming off of micro-fracture surgery. If in any kind of .5 or full PPR, Woody should always be a draft target."
  },
  {
    "Player": "T.J. Yeldon JAC (5)",
    "BallersRank": 30,
    "ADP": 8.1,
    "Projected Pts.": 135.2,
    "Risk": 4.13,
    "Tier": "TIER 5",
    "Vid": "",
    "Notes": "One of the biggest perceived losers of the offseason. The Jags stunned the fantasy world by giving Chris Ivory a financially strong contract in a world where teams are getting RB production on the cheap. No one quite knows how the workload will shape out, but Yeldon should remain safe as the pass catching back. Depending on his freefall, he could be a draft day steal."
  },
  {
    "Player": "DeAngelo Williams PIT (8)",
    "BallersRank": 31,
    "ADP": 6.02,
    "Projected Pts.": 129.03,
    "Risk": 2.5,
    "Tier": "TIER 5",
    "Vid": "",
    "Notes": "DWill is going to be the man in Pitt for the first 4 games (assuming Bell doesn't win his appeal, which is unlikely). For those that go in on Bell, he is a great fill in for the early season. It's not going to be cheap however. But to spend a 2nd and a 6th for the Pitt RB production, it's a bit risky, but very high reward if for those that want to jump in."
  },
  {
    "Player": "Ameer Abdullah DET (10)",
    "BallersRank": 32,
    "ADP": 7.09,
    "Projected Pts.": 130.83,
    "Risk": 4.5,
    "Tier": "TIER 5",
    "Vid": "",
    "Notes": "The Abdullah Express never got it's engines rolling last year. The Lions had the lowest amount of rushing yards in the league. But now Joique Bell is gone and Detroit replaced him with a recovering Stevan Ridley. Abdullah is going to be given a chance to be the man in Detroit. Due to the high level degree fantasy burns he dished out last year, he could be a tremendous value."
  },
  {
    "Player": "Chris Ivory JAC (5)",
    "BallersRank": 33,
    "ADP": 6.04,
    "Projected Pts.": 128.5,
    "Risk": 4.37,
    "Tier": "TIER 5",
    "Vid": "",
    "Notes": "Ivory was considered one of the better free agents available this offseason. He ended up taking a nice contract from Jacksonville, a place he knew he wouldn't be the featured back. Judging the workload is a bit of a guessing game right now, but he is likely to be a high priced handcuff and goal line back."
  },
  {
    "Player": "Duke Johnson CLE (13)",
    "BallersRank": 34,
    "ADP": 7.03,
    "Projected Pts.": 122.9,
    "Risk": 2.7,
    "Tier": "TIER 5",
    "Vid": "",
    "Notes": "Duke Johnson didn't have much juice running between the tackles but excelled in the passing game. He caught over 60 balls and is lined up to repeat a high catch season. New Head Coach, Hue Jackson had great success with Jeremy Hill and Gio Bernard. Look for Duke to run in that Gio role."
  },
  {
    "Player": "LeGarrette Blount NE (9)",
    "BallersRank": 35,
    "ADP": 8.12,
    "Projected Pts.": 116.37,
    "Risk": 4.3,
    "Tier": "TIER 5",
    "Vid": "",
    "Notes": "Let's be clear, nobody starts Blount and thinks, \"oh yeah, Blount's gonna win this week all by himself!\". But that's exactly what he does from time to time. Good luck trying to break through the encryption that is Bill Belichick and know when it's going to happen. It will happen, and Blount is worth a roster spot."
  },
  {
    "Player": "Rashad Jennings NYG (8)",
    "BallersRank": 36,
    "ADP": 7.01,
    "Projected Pts.": 118.17,
    "Risk": 5.5,
    "Tier": "TIER 5",
    "Vid": "",
    "Notes": "Rashad Jennings finished the year on a tear. He was a top fantasy option the last quarter of the year. The Giants may have found a replacement in Paul Perkins, but that transition is likely to take some time. Jennings is going to provide a solid value for at least the first half of the year, especially if the Giants can manage to pull the plug on the Andre Williams experiment."
  },
  {
    "Player": "Charles Sims TB (6)",
    "BallersRank": 37,
    "ADP": 9.02,
    "Projected Pts.": 120.23,
    "Risk": 2.77,
    "Tier": "TIER 5",
    "Vid": "",
    "Notes": "Sims was on a lot of fantasy radars his rookie year, but was quickly derailed by an injury and a horrific offense. Sims bounced back strong, finishing as an RB2 despite having to play behind Doug Martin. In case you missed it here's Sims season recap, over 100 carries at nearly 5.0YPC on top of 51 receptions. Don't think of Sims as an expensive handcuff, he's that, but also a player that has standalone flex appeal."
  },
  {
    "Player": "Justin Forsett BAL (8)",
    "BallersRank": 38,
    "ADP": 7.12,
    "Projected Pts.": 117.03,
    "Risk": 5.7,
    "Tier": "TIER 5",
    "Vid": "",
    "Notes": "Forsett was one of the higher drafted backs that struggled at the top of the season. He eventually got his groove going with a couple of monster games, despite a depleted Ravens offense. His season was brought to an abrupt end when Aaron Donald power-bombed him and broke his arm. Concern of Forsett's place on the depth chart is real and valid, but he's a potential starting RB coming at a great value."
  },
  {
    "Player": "Bilal Powell  NYJ (11)",
    "BallersRank": 39,
    "ADP": 9.09,
    "Projected Pts.": 109.97,
    "Risk": 3.83,
    "Tier": "TIER 6",
    "Vid": "",
    "Notes": "Powell came through for fantasy players down the stretch, hauling in 23 receptions over the final four games. His role is unknown at this point as the Jets replaced Chris Ivory with the veteran Matt Forte, who also excels in the passing game. The Jets know what they have in Powell, he will have a role, and that role could expand if Forte struggles."
  },
  {
    "Player": "Jay Ajayi MIA (8)",
    "BallersRank": 40,
    "ADP": 8.08,
    "Projected Pts.": 101.53,
    "Risk": 5.3,
    "Tier": "TIER 6",
    "Vid": "",
    "Notes": "The nightmare Ajayi backers were dreading came true. Arian Foster has taken his talents to South Beach. But, a ruptured achilles is an injury that is nearly impossible to see a full recovery from for running backs. Foster already looked as if he had slowed down in the running game. Ajayi could become a decent value now in fantasy drafts. It is still possible for him to be the primary RB for Miami, and Gase has shown he loves to have a guy in the backfield that takes the majority of the work. It's a situation to watch through camp and preseason."
  },
  {
    "Player": "Theo Riddick DET (10)",
    "BallersRank": 41,
    "ADP": 12.04,
    "Projected Pts.": 97.93,
    "Risk": 2.93,
    "Tier": "TIER 6",
    "Vid": "",
    "Notes": "Riddick was an early sleeper favorite before the Lions drafted Ameer Abdullah. Riddick didn't let the rookie get in his way of leading all RBs in total receptions with 80. There's no signs of Riddick slowing down in that role. With Megatron retiring, there could be even more short passes coming his way. Theo Riddick looks to join the ranks of Danny Woodhead as an overlooked RB that bathes in targets."
  },
  {
    "Player": "Derrick Henry TEN (13)",
    "BallersRank": 42,
    "ADP": 7.11,
    "Projected Pts.": 98.87,
    "Risk": 4.7,
    "Tier": "TIER 6",
    "Vid": "",
    "Notes": "Henry looked very capable in his pro debut, strong, tough, like someone that actually could challenge Murray for carries. This is a situation to watch and feel out. Unfortunately, the draft price is way too high for Henry right now, and is likely to go up if he continues to have success."
  },
  {
    "Player": "Darren Sproles PHI (4)",
    "BallersRank": 43,
    "ADP": 13.08,
    "Projected Pts.": 96.88,
    "Risk": 5.83,
    "Tier": "TIER 6",
    "Vid": "",
    "Notes": "A gadget type player that was rumored to be shipped out of town. We always seem to doubt Sproles, but he almost always punches that doubt square in the face. Don't rule him out completely, he's fine to take with a late round pick. But, don't set expectations too high."
  },
  {
    "Player": "James White NE (9)",
    "BallersRank": 44,
    "ADP": 0,
    "Projected Pts.": 95.83,
    "Risk": 6,
    "Tier": "TIER 6",
    "Vid": "",
    "Notes": "White just took a major escalator ride up the rankings with the news that Dion Lewis is going to need a second knee surgery. White has looked decent in preseason, and was an ok fantasy replacement for Lewis last season. The question now becomes, what offense are we going to see from the Patriots? Will it be the short pass, run through the air? Or will they buck the trend again, line up 2TE formations and let Blount grind down the defense?"
  },
  {
    "Player": "Shane Vereen NYG (8)",
    "BallersRank": 45,
    "ADP": 0,
    "Projected Pts.": 93.33,
    "Risk": 5.25,
    "Tier": "TIER 6",
    "Vid": "",
    "Notes": "It was feast or famine with the passing down specialist. His contract suggests the Giants will keep him around and give him another shot. The biggest value Vereen could bring to a fantasy owner, is having a few good games on their bench and building value to be part of a trade. He can't be trusted."
  },
  {
    "Player": "Javorius Allen BAL (8)",
    "BallersRank": 46,
    "ADP": 0,
    "Projected Pts.": 90.67,
    "Risk": 6.03,
    "Tier": "TIER 6",
    "Vid": "",
    "Notes": "Javorius “Buck” Allen had a decent amount of fantasy hype last year and eventually given a starting opportunity. His rushing game left a lot to be desired, but he was solid in the passing game. With Justin Forsett coming back 100% and the team picking up Kenneth Dixon, it's hard to see where Buck fits in."
  },
  {
    "Player": "Christine Michael SEA (5)",
    "BallersRank": 47,
    "ADP": 10.09,
    "Projected Pts.": 90.2,
    "Risk": 5.7,
    "Tier": "TIER 6",
    "Vid": "",
    "Notes": "#TheAwakening! If you trust your eyes, they are telling you CMike looks different. His 2nd round talent has been flashing this preseason. Rawls still hasn't found his way into a game, and Michael is taking full advantage. If for any reason Rawls isn't ready to go, CMike would be the main guy for Seattle. Even if Rawls is ready to go, Coach Carroll has already called Rawls/Michael a \"1-2 punch\". Worth a flier at this point."
  },
  {
    "Player": "Tevin Coleman ATL (11)",
    "BallersRank": 48,
    "ADP": 9.05,
    "Projected Pts.": 86.43,
    "Risk": 4.7,
    "Tier": "TIER 6",
    "Vid": "",
    "Notes": "History lesson: Coleman was at the top of the Falcons RB depth chart as a rookie. His first game didn't set the world on fire, but he showed why he was a 2nd round draft pick. A rib injury and a Devonta Freeman catching fire sent Coleman spiraling down the depth chart. Coleman will have his place in the running game, Freeman only averaged 3.12YPC over the final 5 games."
  },
  {
    "Player": "DeAndre Washington OAK (10)",
    "BallersRank": 49,
    "ADP": 10.08,
    "Projected Pts.": 75.63,
    "Risk": 5.37,
    "Tier": "TIER 7",
    "Vid": "",
    "Notes": "Washington provides a very interesting late round value. Oakland was not shy about proclaiming their need to improve at the RB despite Latavius Murray having a decent season. Oakland was rumored to be in the mix for Doug Martin, as well as DeMarco Murray last year. Instead of making a big splash, the Raiders went with Washington in the draft. If Murray falters or gets benched like he did last year, look for Washington to be the benefactor."
  },
  {
    "Player": "C.J. Prosise SEA (5)",
    "BallersRank": 50,
    "ADP": 13.05,
    "Projected Pts.": 79.03,
    "Risk": 3.97,
    "Tier": "TIER 7",
    "Vid": "",
    "Notes": "Prosise was snagged in the 3rd round by Seattle and was immediately talked up as being the new passing downs RB. It makes sense as Prosise is a converted WR, a la David Johnson. Prosise offers a whole lot of upside as the only thing standing in his way of being a 3-down back is a guy who went undrafted, Thomas Rawls."
  },
  {
    "Player": "Chris Thompson WAS (9)",
    "BallersRank": 51,
    "ADP": 0,
    "Projected Pts.": 77.63,
    "Risk": 5.75,
    "Tier": "TIER 7",
    "Vid": "",
    "Notes": "Thompson could find himself looking at a decent passing downs job in Washington. He was decently productive before his injury last year. However, whispers in the bushes say Thompson could be looking at finding a new job before the season starts."
  },
  {
    "Player": "Dion Lewis NE (9)",
    "BallersRank": 52,
    "ADP": 5.04,
    "Projected Pts.": 68.87,
    "Risk": 4.77,
    "Tier": "TIER 7",
    "Vid": "",
    "Notes": "News has broken that Lewis is now looking at second surgery on his knee. A huge blow for the breakout RB. He is sure to end up starting the year on the PUP list. If you have an IR slot in your league, drafting him late is still an ok play. If not, it's likely hands off for Lewis."
  },
  {
    "Player": "Darren McFadden DAL (7)",
    "BallersRank": 53,
    "ADP": 0,
    "Projected Pts.": 76,
    "Risk": 5.03,
    "Tier": "TIER 7",
    "Vid": "",
    "Notes": "Welp. The Frankenstein resurrection for Darren McFadden was short lived after the Cowboys used the 4th overall pick on a running back. Once handed the starting job, DMC was actually great. There will still be a place for him in the passing game, but it would take an injury to Ezekiel Elliott for him to have true fantasy value now."
  },
  {
    "Player": "Devontae Booker DEN (11)",
    "BallersRank": 54,
    "ADP": 11.08,
    "Projected Pts.": 73.17,
    "Risk": 6.03,
    "Tier": "TIER 7",
    "Vid": "",
    "Notes": "Booker fell a lot further than the draft community predicted he would, eventually being snagged up by the Broncos. The signing of Booker is likely worse for Ronnie Hillman than starter C.J. Anderson. But if Anderson squanders another starting opportunity in the beginning of next year, Booker has the talent to step in a be a bigtime producer."
  },
  {
    "Player": "Terrance West BAL (8)",
    "BallersRank": 55,
    "ADP": 12.11,
    "Projected Pts.": 69.27,
    "Risk": 8,
    "Tier": "TIER 7",
    "Vid": "",
    "Notes": "Rising from the dead like some kind of running back zombie, West is drawing praise from his coaching staff. Originally looked on as the dispensible RB on the Ravens squad, with a solid preseason showing West could find a role for himself. Certainly a player to monitor at the very least."
  },
  {
    "Player": "Karlos Williams FA",
    "BallersRank": 56,
    "ADP": 12.05,
    "Projected Pts.": 51.6,
    "Risk": 2.73,
    "Tier": "TIER 7",
    "Vid": "",
    "Notes": "Karlos Williams came into the offseason as a HOT commodity. He was scoring TDs at a historic rate, played for a run first (and second and third) offensive system and seemed prime to break out. Unfortunately Karlos is no more in Buffalo due to a terrible offseason that comprised of gaining weight and a back-breaking suspension.  He's currently a free-agent."
  },
  {
    "Player": "Zach Zenner DET (10)",
    "BallersRank": 57,
    "ADP": 0,
    "Projected Pts.": 71.63,
    "Risk": 7,
    "Tier": "TIER 7",
    "Vid": "",
    "Notes": "Zenner has found himself moving up the depth chart, now that Ridley has officially been cut. Clearly the Lions feel confident in the RB crew and with Zenner as the big back. He has some late round flier upside, but he's likely going to have to score to produce any kind of fantasy numbers."
  },
  {
    "Player": "Alfred Morris DAL (7)",
    "BallersRank": 58,
    "ADP": 12.06,
    "Projected Pts.": 65.5,
    "Risk": 5.47,
    "Tier": "TIER 7",
    "Vid": "",
    "Notes": "My oh my, just a few months ago things were looking up for the seasoned veteran! Then Jerry Jones and the Cowboys drafted EZ-Eliiott with the 4th overall pick. Morris brings nearly nothing to the passing game, which would be the way for him to stay relevant. All signs point to Morris taking reps only when Elliott needs to catch his breath."
  },
  {
    "Player": "Josh Ferguson IND (10)",
    "BallersRank": 59,
    "ADP": 0,
    "Projected Pts.": 69.04,
    "Risk": 5.73,
    "Tier": "TIER 7",
    "Vid": "",
    "Notes": "Josh Ferguson was an undrafted rookie free agent signing this year. That might not sound like much, but the word from Indy is that they were considering drafting him as high as the 4th round. They backed up their belief in him by giving him one of the highest paid UDFA contracts this year. With only old man Frank Gore and currently-in-trouble Robert Turbin ahead of him, he could end up seeing a valuable role this year with a high power offense."
  },
  {
    "Player": "Kenneth Dixon BAL (8)",
    "BallersRank": 60,
    "ADP": 14.03,
    "Projected Pts.": 67.67,
    "Risk": 6.7,
    "Tier": "TIER 7",
    "Vid": "",
    "Notes": "Dixon is one of six running backs currently on the Ravens roster. Six. Granted it won't be that many when the season rolls around, but he's likely to at least begin the season towards the back of the line. Dixon is regarded highly by the draft community and is a candidate to move into a starting role before the season is over."
  },
  {
    "Player": "Jordan Howard CHI (9)",
    "BallersRank": 61,
    "ADP": 14.05,
    "Projected Pts.": 64.57,
    "Risk": 6.03,
    "Tier": "TIER 7",
    "Vid": "",
    "Notes": "The RBs in front of Howard, Jeremy Langford and Ka'Deem Carey, aren't the most talented RBs out there. They do have experience that Howard is lacking. But neither Langford nor Carey have a long history being the primary ball carrier, leaving a glimmer of hope for the Jordan Howard Truthers."
  },
  {
    "Player": "Chris Johnson ARI (9)",
    "BallersRank": 62,
    "ADP": 11.11,
    "Projected Pts.": 52.17,
    "Risk": 3.5,
    "Tier": "TIER 7",
    "Vid": "",
    "Notes": "Chris Johnson showed he still had a bit left in the tank. But the starting job now belongs to David Johnson. Chris remains a decent handcuff with Arizona being among the most potent offenses in the league."
  },
  {
    "Player": "Wendell Smallwood PHI (4)",
    "BallersRank": 62,
    "ADP": 0,
    "Projected Pts.": 60.37,
    "Risk": 6.07,
    "Tier": "TIER 7",
    "Vid": "",
    "Notes": "Smallwood joins a thin backfield in Philly. When the season starts, he looks to be behind the fragile Ryan Mathews, and the gadget-esque Darren Sproles. The buzz behind Smallwood has been growing lately and with good cause. He should find at least a small role immediately. He could also be this year's Charcandrick West if Mathews goes down (again)."
  },
  {
    "Player": "Charcandrick West KC (5)",
    "BallersRank": 64,
    "ADP": 11.02,
    "Projected Pts.": 48.27,
    "Risk": 4.5,
    "Tier": "TIER 7",
    "Vid": "",
    "Notes": "When Jamaal Charles looked for another punch on his ACL card (1 more and he gets a free donut) many fantasy owners laughed maniacally and got ready to unleash Knile Davis. That looked great...until the Chiefs screamed, \"CHARIZARD! I choose you!\". Char West had some great games, before an injury introduced a timeshare with Spencer Ware. BUT, looks like Ware is the true handcuff to own at this point."
  },
  {
    "Player": "Jerick McKinnon MIN (6)",
    "BallersRank": 65,
    "ADP": 13.06,
    "Projected Pts.": 45.17,
    "Risk": 3.5,
    "Tier": "TIER 7",
    "Vid": "",
    "Notes": "McKinnon has been placed on the tortoise track of development. Highly regarded by the metrics community, the team just doesn't seem to have trust in McKinnon, often going to the adorable Matt Asiata instead. McKinnon did see an increase in targets down the stretch and the Vikes could be grooming him for that role, which would make him worthy of a roster spot."
  },
  {
    "Player": "Ronnie Hillman DEN (11)",
    "BallersRank": 66,
    "ADP": 0,
    "Projected Pts.": 38.67,
    "Risk": 6.7,
    "Tier": "TIER 7",
    "Vid": "",
    "Notes": "Hillman managed to trick the Broncos into re-signing him over the offseason. To be fair, he had his moments of looking great, but they were sandwiched in between multiple-game long stretches of looking like Ronnie Hillman. With the acquisition of Devontae Booker, Hillman could find himself in a Sisyphus situation at the bottom of the depth chart."
  },
  {
    "Player": "Ka'Deem Carey CHI (9)",
    "BallersRank": 67,
    "ADP": 0,
    "Projected Pts.": 39,
    "Risk": 6,
    "Tier": "TIER 8",
    "Vid": "",
    "Notes": "Carey was given the first offensive snap the game after Matt Forte went down last year. Because he earned it by being an tremendous player you say? No, because John Fox does ridiculous things all the time. Carey will undoubtedly vulture off of Jeremy Langford, because John Fox hates puppies and loves sadness."
  },
  {
    "Player": "James Starks GB (4)",
    "BallersRank": 67,
    "ADP": 13.12,
    "Projected Pts.": 42.33,
    "Risk": 3.15,
    "Tier": "TIER 8",
    "Vid": "",
    "Notes": "If it was ever going to happen for James Starks, it was last year. What I'm saying is, it's not going to happen for James Starks. Expect Eddie Money to show up fully jacked thus relegating Starks to a backup position. He is a decent handcuff for what that's worth."
  },
  {
    "Player": "Paul Perkins NYG (8)",
    "BallersRank": 69,
    "ADP": 0,
    "Projected Pts.": 52.17,
    "Risk": 6.03,
    "Tier": "TIER 8",
    "Vid": "",
    "Notes": "Perkins is being lauded by many sources as one of the steals of the draft. That would be incredible news for the Giants who are desperate need of a running back they can count on. Jennings is decent but he's 31 and last year was the first time he made it through 16 games. Perkins is a very interesting flier and has the feel of a 2nd half monster."
  },
  {
    "Player": "Andre Williams NYG (8)",
    "BallersRank": 70,
    "ADP": 0,
    "Projected Pts.": 48.93,
    "Risk": 7,
    "Tier": "TIER 8",
    "Vid": "",
    "Notes": ""
  },
  {
    "Player": "Kenyan Drake MIA (8)",
    "BallersRank": 71,
    "ADP": 0,
    "Projected Pts.": 39.33,
    "Risk": 5.07,
    "Tier": "TIER 8",
    "Vid": "",
    "Notes": "Drake is an electric talent who wasn't used much in college. His tape shows true NFL breakaway speed, great chops in the passing game, and should be a quality kick returner. After being drafted in the 3rd round, Drake became Jason's second favorite rookie. After hurting his hamstring and Arian Foster's signing, that all changed. It's going to take major injuries in front of him to do anything for fantasy owners in 2016."
  },
  {
    "Player": "Alfred Blue HOU (9)",
    "BallersRank": 72,
    "ADP": 0,
    "Projected Pts.": 38.33,
    "Risk": 4.5,
    "Tier": "TIER 8",
    "Vid": "",
    "Notes": "Nobody's favorite handcuff. The most one can say about Blue is he's a veteran that will get a solid workload if the starter in front of him goes down. Since it's not Arian Foster anymore, and a much more durable Lamar Miller, Blue's 2016 outlook is not looking good."
  },
  {
    "Player": "Tim Hightower NO (5)",
    "BallersRank": 73,
    "ADP": 14.02,
    "Projected Pts.": 35.33,
    "Risk": 3,
    "Tier": "TIER 8",
    "Vid": "",
    "Notes": "Hightower was exactly what everyone expected last season. He hadn't taken a single NFL snap since 2011, but jumps right into the action and a heavy workload when Mark Ingram went down. The Ballad of Hightower will never be forgotten by those courageous enough to pick him up and start him through the fantasy playoffs. Looks like another solid HAAANDCuff."
  },
  {
    "Player": "Keith Marshall WAS (9)",
    "BallersRank": 74,
    "ADP": 0,
    "Projected Pts.": 72.65,
    "Risk": 6.75,
    "Tier": "TIER 8",
    "Vid": "",
    "Notes": "Keith Marshall is the 7th round rookie running back selected by the Washington Redskins. Marshall is extremely fast (we're talking CJ2K combine level fast) and a talented athlete. The biggest knock on Marshall has always been his complete inability to stay healthy. But if he is healthy (as he is in training camp) then he has an opportunity to carve out a role in a pretty empty backfield behind inefficient runner Matt Jones."
  },
  {
    "Player": "Andre Ellington ARI (9)",
    "BallersRank": 75,
    "ADP": 0,
    "Projected Pts.": 31.33,
    "Risk": 6.5,
    "Tier": "TIER 8",
    "Vid": "",
    "Notes": "A very unfortunate set of circumstances for Ellington. He was like a flash fire his rookie season, constantly breaking huge runs. He wasn't extremely efficient his sophomore season when he was given a large workload, eventually breaking down. Then he passed by Chris and David Johnson on the depth chart. The juice is there for fantasy production, but the opportunity isn't coming."
  },
  {
    "Player": "Spencer Ware KC (5)",
    "BallersRank": 76,
    "ADP": 13.07,
    "Projected Pts.": 30.43,
    "Risk": 5,
    "Tier": "TIER 8",
    "Vid": "",
    "Notes": "Looks like the heir to the Chiefs RB throne if Charles goes down. Also looks more than capable if that situation arises. Had solid production last year. A solid haaaannddcuufff if that's what you are looking for."
  },
  {
    "Player": "Khiry Robinson NYJ (11)",
    "BallersRank": 77,
    "ADP": 0,
    "Projected Pts.": 33.5,
    "Risk": 2.7,
    "Tier": "TIER 8",
    "Vid": "",
    "Notes": "Robinson has flashed on occasion but wasn't able to get a better gig than 3rd on the depth chart for the Jets. If something were to happen to Forte, Robinson would likely get the bulk of the early down work over Bilal Powell."
  },
  {
    "Player": "C.J. Spiller NO (5)",
    "BallersRank": 78,
    "ADP": 0,
    "Projected Pts.": 32,
    "Risk": 6.5,
    "Tier": "TIER 8",
    "Vid": "",
    "Notes": "Shouldn't be written off completely, mostly, but not completely. Worth picking up with a really late pick in the event the Saints decide to work him into an actual gameplan."
  },
  {
    "Player": "David Cobb TEN (13)",
    "BallersRank": 79,
    "ADP": 0,
    "Projected Pts.": 13.23,
    "Risk": 8.03,
    "Tier": "TIER 9",
    "Vid": "",
    "Notes": "Apparently David Cobb is still on the Titans. Feel free to move on."
  },
  {
    "Player": "Damien Williams MIA (8)",
    "BallersRank": 80,
    "ADP": 0,
    "Projected Pts.": 19.47,
    "Risk": 6,
    "Tier": "TIER 9",
    "Vid": "",
    "Notes": ""
  },
  {
    "Player": "Cameron Artis-Payne CAR (7)",
    "BallersRank": 81,
    "ADP": 0,
    "Projected Pts.": 24.5,
    "Risk": 4.5,
    "Tier": "TIER 9",
    "Vid": "",
    "Notes": "Artis-Payne was basically a non-factor last season. Even when Jonathan Stewart went down and the stage was set for CAP to make his debut, the Panthers turned to the likes of Fozzy Whittaker and others. Not a starter, not a handcuff."
  },
  {
    "Player": "Benny Cunningham LA (8)",
    "BallersRank": 82,
    "ADP": 0,
    "Projected Pts.": 30.67,
    "Risk": 4,
    "Tier": "TIER 9",
    "Vid": "",
    "Notes": ""
  },
  {
    "Player": "Stevan Ridley, FA",
    "BallersRank": 83,
    "ADP": 0,
    "Projected Pts.": 24,
    "Risk": 6,
    "Tier": "TIER 9",
    "Vid": "",
    "Notes": "Just got cut bby Detroit."
  },
  {
    "Player": "Joique Bell, FA",
    "BallersRank": 84,
    "ADP": 0,
    "Projected Pts.": 0,
    "Risk": 0,
    "Tier": "TIER 9",
    "Vid": "",
    "Notes": "Ding dong. Who's there? An aging RB that can't find a new team."
  },
  {
    "Player": "Antonio Andrews TEN (13)",
    "BallersRank": 85,
    "ADP": 0,
    "Projected Pts.": 5.83,
    "Risk": 6,
    "Tier": "TIER 9",
    "Vid": "",
    "Notes": "The drafting of Derrick Henry started the beginning of the end for Andrews."
  },
  {
    "Player": "Tre Mason LA (8)",
    "BallersRank": 86,
    "ADP": 0,
    "Projected Pts.": 0,
    "Risk": 0,
    "Tier": "TIER 9",
    "Vid": "",
    "Notes": ""
  },
  {
    "Player": "Orleans Darkwa  NYG (8)",
    "BallersRank": 87,
    "ADP": 0,
    "Projected Pts.": 0,
    "Risk": 0,
    "Tier": "TIER 9",
    "Vid": "",
    "Notes": ""
  },
  {
    "Player": "Lance Dunbar DAL (7)",
    "BallersRank": 88,
    "ADP": 0,
    "Projected Pts.": 4.33,
    "Risk": 7,
    "Tier": "TIER 9",
    "Vid": "",
    "Notes": "Dunbar clearly has Wolverine blood, because he is off of the PUP after tearing his ACL and Patellar tendon last year. It remains to be seen if/when he will be ready for any kind of action, as all recent players suffering a similar injury still have yet to get back on the NFL field."
  },
  {
    "Player": "Denard Robinson JAC (5)",
    "BallersRank": 89,
    "ADP": 0,
    "Projected Pts.": 0,
    "Risk": 0,
    "Tier": "TIER 9",
    "Vid": "",
    "Notes": ""
  },
  {
    "Player": "Knile Davis KC (5)",
    "BallersRank": 90,
    "ADP": 0,
    "Projected Pts.": 0,
    "Risk": 0,
    "Tier": "TIER 9",
    "Vid": "",
    "Notes": ""
  },
  {
    "Player": "Juwan Thompson DEN (11)",
    "BallersRank": 91,
    "ADP": 0,
    "Projected Pts.": 0,
    "Risk": 0,
    "Tier": "TIER 9",
    "Vid": "",
    "Notes": ""
  },
  {
    "Player": "Bishop Sankey TEN (13)",
    "BallersRank": 92,
    "ADP": 0,
    "Projected Pts.": 0,
    "Risk": 0,
    "Tier": "TIER 9",
    "Vid": "",
    "Notes": "1st RB taken in the 2014 draft. Yes, that did happen."
  },
  {
    "Player": "Fred Jackson, FA",
    "BallersRank": 93,
    "ADP": 0,
    "Projected Pts.": 0,
    "Risk": 0,
    "Tier": "TIER 7",
    "Vid": "",
    "Notes": ""
  },
  {
    "Player": "Mike Tolbert CAR (7)",
    "BallersRank": 94,
    "ADP": 0,
    "Projected Pts.": 0,
    "Risk": 0,
    "Tier": "TIER 9",
    "Vid": "",
    "Notes": ""
  },
  {
    "Player": "Chris Polk HOU (9)",
    "BallersRank": 95,
    "ADP": 0,
    "Projected Pts.": 0,
    "Risk": 0,
    "Tier": "TIER 9",
    "Vid": "",
    "Notes": ""
  },
  {
    "Player": "Roy Helu OAK (10)",
    "BallersRank": 96,
    "ADP": 0,
    "Projected Pts.": 0,
    "Risk": 0,
    "Tier": "TIER 9",
    "Vid": "",
    "Notes": "HELUUUUUUU!!!! ....goodbye"
  },
  {
    "Player": "Dexter McCluster TEN (13)",
    "BallersRank": 97,
    "ADP": 0,
    "Projected Pts.": 0,
    "Risk": 0,
    "Tier": "TIER 9",
    "Vid": "",
    "Notes": ""
  },
  {
    "Player": "Brandon Bolden NE (9)",
    "BallersRank": 98,
    "ADP": 0,
    "Projected Pts.": 0,
    "Risk": 0,
    "Tier": "TIER 9",
    "Vid": "",
    "Notes": ""
  },
  {
    "Player": "Daniel Herron, FA",
    "BallersRank": 99,
    "ADP": 0,
    "Projected Pts.": 0,
    "Risk": 0,
    "Tier": "TIER 9",
    "Vid": "",
    "Notes": ""
  }
]