[
  {
    "Player": "Rob Gronkowski NE (9)",
    "BallersRank": 1,
    "ADP": 2.02,
    "Projected Pts.": 216.93,
    "Risk": 4,
    "Tier": "TIER 1",
    "Vid": "",
    "Notes": "Gronk has finished as the top TE two years in a row and it wasn't even close. He averages 27 more points than the #2 TE in that span and guarantees you a great point advantage at that position. But in 80 games, he's never played without Tom Brady who will be missing for the first 4 games. He'll cost you a first round pick, which makes the pick a little risky."
  },
  {
    "Player": "Jordan Reed WAS (9)",
    "BallersRank": 2,
    "ADP": 4.04,
    "Projected Pts.": 196.8,
    "Risk": 6.03,
    "Tier": "TIER 2",
    "Vid": "",
    "Notes": "Rule 86 says that if Jordan Reed is playing, he's in your lineup. In a PPR setting last year he actually outpaced Gronk for the games he played. If he can stay on the field, he could be a better draft day value than Gronk as he can be grabbed in the third or fourth. But his injury history is a major concern. In three years he's missed 15 games or almost 1 out of every 3 games."
  },
  {
    "Player": "Greg Olsen CAR (7)",
    "BallersRank": 3,
    "ADP": 5.02,
    "Projected Pts.": 170,
    "Risk": 1.37,
    "Tier": "TIER 3",
    "Vid": "",
    "Notes": "Greg Olsen is tried and true. He has back to back 1,000 yard seasons and hasn't missed a game in EIGHT straight seasons. His reliability makes him a plug and play start. He won't finish #1, but he won't finish out of the top 8 either."
  },
  {
    "Player": "Travis Kelce KC (5)",
    "BallersRank": 4,
    "ADP": 6.04,
    "Projected Pts.": 165.27,
    "Risk": 3.63,
    "Tier": "TIER 3",
    "Vid": "",
    "Notes": "Zeus was highly touted, highly drafted, and highly disappointed you last year in fantasy football. He didn't finish terrible, but for the capital it took to get him, he didn't return. This year we should see much of what we saw last year from him. He's one of the best Tight Ends in the league and dynamic when he gets used in the passing game. I expect a few more TDs to fall his way this year and he has the best strength of schedule in 2016 for the Tight End position. All of that could make Kelce a draft day steal if you aren't too let down from last season."
  },
  {
    "Player": "Gary Barnidge CLE (13)",
    "BallersRank": 5,
    "ADP": 8.07,
    "Projected Pts.": 168.77,
    "Risk": 3.83,
    "Tier": "TIER 3",
    "Vid": "",
    "Notes": "Maximum Barnidge came out of NOWHERE last year to finish as the 2nd or 3rd best TE depending on your scoring system. While he was better with McCown at the helm, he was still used quite a bit when Manziel took over. Add in the fact that the Browns gave him a hefty contract this offseason and there is all the reason to believe that he can reproduce what he did last year no matter who is under center. Hue Jackson did a great job last year using Tyler Eifert in the redzone and he is bringing his offense with him to the Browns. There just aren't many options for Cleveland, other than throwing the ball his way often, which is something you look for in a fantasy TE."
  },
  {
    "Player": "Coby Fleener NO (5)",
    "BallersRank": 6,
    "ADP": 6.07,
    "Projected Pts.": 163.83,
    "Risk": 3.67,
    "Tier": "TIER 3",
    "Vid": "",
    "Notes": "The saints utilize the TE better than any team over the last 6 seasons. Last year Benjamin Watson finished as a top TE at the ripe old age of 35. Fleener has size, speed, youth, and route running ability to exceed what Watson did and should be one of the steals of the draft if you can grab him late."
  },
  {
    "Player": "Delanie Walker TEN (13)",
    "BallersRank": 7,
    "ADP": 7.02,
    "Projected Pts.": 152.93,
    "Risk": 4.5,
    "Tier": "TIER 4",
    "Vid": "",
    "Notes": "Delanie Walker just signed a new contract which is always a good sign for a player being used in the same role. That being said, the Titans want to run the ball more this year with their \"exotic smashmouth\" offense. When you add in that they will have Kendall Wright healthy, a more experienced DGB, and brought in new passcatcher Rishard Matthews into town we expect Delanie Walker to come down a bit from his career high season last year."
  },
  {
    "Player": "Zach Ertz PHI (4)",
    "BallersRank": 8,
    "ADP": 10.08,
    "Projected Pts.": 154.33,
    "Risk": 5.03,
    "Tier": "TIER 4",
    "Vid": "",
    "Notes": "Ertz is a favorite of The Fantasy Footballers. He is a good route runner who should be able to do some special things this year. He took a big step forward in his third season jumping up to 75 receptions and over 850 yards. The problem was TDs. Despite 75 catches, he only had 2 touchdowns. Most of the blame for this should not go his way though as Bradford targeted, and missed, Ertz in the redzone numerous times last year. They started finding their groove late last year and with another year together, if Bradford is the starter, Ertz should have a very good fantasy season."
  },
  {
    "Player": "Antonio Gates SD (11)",
    "BallersRank": 8,
    "ADP": 10.02,
    "Projected Pts.": 156.3,
    "Risk": 5,
    "Tier": "TIER 4",
    "Vid": "",
    "Notes": "Gates could be the steal of the position this year. Yes, he's old. Yes, he's broken down. Yes, he's still a dominate weapon for Philip Rivers who is being drafted at the very back of the draft. Ladarius Green is out of town and Hunter Henry is only a rookie who won't make a big impact. Gates is the go to 3rd down guy and utilized well in the red zone. The Chargers also boast the third best schedule for fantasy tight ends this year."
  },
  {
    "Player": "Eric Ebron DET (10)",
    "BallersRank": 10,
    "ADP": 13.12,
    "Projected Pts.": 146.37,
    "Risk": 4.13,
    "Tier": "TIER 4",
    "Vid": "",
    "Notes": "Eric Ebron was the 10th overall pick by the Lions when he came out of college for a reason. By every (non-Gronk) standard, tight ends take a few years to come into their own and Ebron is coming into his third year. Even still, his first two years showed glimpses of what could be to come grabbing five TDs in 2015. With Calvin Johnson now retired, there is a huge red zone hole that needs to be filled. If their top 10 pick is able to step up and fill that void, Ebron could be the steal of the tight end class for 2016. Ebron is expected to play Week 1 after going down with an injury in offseason practice."
  },
  {
    "Player": "Dwayne Allen IND (10)",
    "BallersRank": 11,
    "ADP": 12.08,
    "Projected Pts.": 146.37,
    "Risk": 4.83,
    "Tier": "TIER 4",
    "Vid": "",
    "Notes": "The last several years there has been an argument as to who is the better tight end to draft from the Colts. Some people preferred the more-involved Coby Fleener and some preferred the better red zone option, Dwayne Allen. Well now Dwayne Allen is both of those. The Colts have promised to have him more involved in the offense and he was already a key part of their red zone when Andrew Luck was in tow."
  },
  {
    "Player": "Tyler Eifert CIN (9)",
    "BallersRank": 12,
    "ADP": 7.08,
    "Projected Pts.": 145.47,
    "Risk": 5.5,
    "Tier": "TIER 4",
    "Vid": "",
    "Notes": "Eifert the TD machine. Unfortunately, he had a late offseason ankle surgery that looks like it could keep hi out of a few games to start the season. Tyler still thinks he can make it for Week 1, but if you are drafting Eifert it needs to be under the assumption he will miss some time."
  },
  {
    "Player": "Julius Thomas JAC (5)",
    "BallersRank": 12,
    "ADP": 8.09,
    "Projected Pts.": 141.13,
    "Risk": 4.37,
    "Tier": "TIER 5",
    "Vid": "",
    "Notes": "Julius Thomas was a forgotten man last year after his injury derailed a third of his season. During that time Blake Bortles found new TD targets in the Allen bros and didn't seem to use him too much in the redzone. With JT, he needs touchdowns. His value in the 2013-2014 seasons came entirely from his heavy touchdown output of 12 per year. He is not a volume receiver, so if you draft him you have to hope he gets more involved in the red zone offense or plan to stream the position."
  },
  {
    "Player": "Jason Witten DAL (7)",
    "BallersRank": 14,
    "ADP": 14.01,
    "Projected Pts.": 134.97,
    "Risk": 1.5,
    "Tier": "TIER 5",
    "Vid": "",
    "Notes": "Last year seems like a down year for Jason Witten, but it really wasn't. Considering that he lost Tony Romo for most of the year and the team's offense was just downright terrible, he still had over 100 targets and came down with 77 balls. The problem was that he only hit pay-dirt 3 times (he averaged 6 touchdowns a year over the previous 5 seasons). He's still as reliable as they come and a huge part of their offense. He should be what he always is, a low end TE1 and he'll cost you nothing at the draft."
  },
  {
    "Player": "Vance McDonald SF (8)",
    "BallersRank": 15,
    "ADP": 0,
    "Projected Pts.": 136.5,
    "Risk": 4.03,
    "Tier": "TIER 5",
    "Vid": "",
    "Notes": "Had sneaky fantasy value for a tiny chunk of the season. New coach Chip Kelly has seen some successful TE campaigns emerge. McDonald is going to go very late in the draft and has very real upside. He's already showing flashes and a getting a solid amount of preseason targets. Great option if you punt TE."
  },
  {
    "Player": "Zach Miller CHI (9)",
    "BallersRank": 16,
    "ADP": 13.09,
    "Projected Pts.": 132.6,
    "Risk": 5,
    "Tier": "TIER 5",
    "Vid": "",
    "Notes": "The other Zach Miller became a solid waiver wire pickup last season when Martellus Bennett went down. The crazy part for Miller is, he played a total of four games from 2011-2014. He wisely went looking for an immediate payday at the end of the season, but wiser than that nobody offered him anything in the range he was looking for. Eventually he agreed to terms with the Bears. Miller is an intriguing guy if you are looking to completely punt the TE position."
  },
  {
    "Player": "Will Tye NYG (8)",
    "BallersRank": 17,
    "ADP": 0,
    "Projected Pts.": 123.53,
    "Risk": 5.03,
    "Tier": "TIER 5",
    "Vid": "",
    "Notes": "Tye was an UDFA that fought his way onto the Giants roster. Word from those that cover the team feel Tye will be the starter headed into the season. Tye didn't have numbers to blow you away, but he was involved in the offense and received his fair share of targets. If you stack your team with depth and wait on TE, Tye should be in consideration."
  },
  {
    "Player": "Martellus Bennett NE (9)",
    "BallersRank": 17,
    "ADP": 11.02,
    "Projected Pts.": 124.43,
    "Risk": 4.7,
    "Tier": "TIER 6",
    "Vid": "",
    "Notes": "Martellus Bennett has been a capable fantasy tight end for many years and now goes to the Patriots to take on what people hope is the \"Aaron Hernandez role.\" Call us skeptical. There is a reason the Bears let him walk and you could see it in his last season (when he was actually healthy). He's still only 29 and he is an upgrade over Scott Chandler for sure. But the Patriots have tried to fill the \"Aaron Hernandez role\" for years with little to no success because, quite frankly, none of those guys are as good as Hernandez was. Bennett isn't either in this stage of his career. Bennett should get a few TDs this year and be used in the passing game to make him an occasional streamer."
  },
  {
    "Player": "Charles Clay BUF (10)",
    "BallersRank": 19,
    "ADP": 0,
    "Projected Pts.": 114.3,
    "Risk": 4.17,
    "Tier": "TIER 6",
    "Vid": "",
    "Notes": "Charles Clay was not worth the money that the Bills paid to get him last season, but he might be worth a flier late in your draft. Clay is a talented pass catcher with big play potential. We saw him explode a few times last year in Buffalo, but more often than not he was rather quiet. The problem with relying on Clay is that Buffalo is a team that throws near the bottom in the league making Clay a good streamer but lousy to rely on."
  },
  {
    "Player": "Kyle Rudolph MIN (6)",
    "BallersRank": 20,
    "ADP": 0,
    "Projected Pts.": 116.27,
    "Risk": 4,
    "Tier": "TIER 6",
    "Vid": "",
    "Notes": "Rudolph came into the league with very high expectations from the fantasy community. Year after year we would continue to hope for the breakout to happen. At this point he is what he is. He can be the occasional fill in help, but he can't be counted on to be a weekly part of your lineup."
  },
  {
    "Player": "Virgil Green DEN (11)",
    "BallersRank": 21,
    "ADP": 0,
    "Projected Pts.": 91.23,
    "Risk": 5.93,
    "Tier": "TIER 6",
    "Vid": "",
    "Notes": "An athletic monster that many in the fantasy industry have pleaded to see unleashed. This could be the year. The team has been talking him up. Kubiak has a system that generally involves the TE. He's getting the targets in preseason. Green is a name to keep in mind if you punt on TE."
  },
  {
    "Player": "Clive Walford OAK (10)",
    "BallersRank": 22,
    "ADP": 0,
    "Projected Pts.": 107.4,
    "Risk": 5.33,
    "Tier": "TIER 6",
    "Vid": "",
    "Notes": "A decent sleeper at the TE spot. QB Derek Carr has shown he will get the ball to the TE. Walford was a rookie last year, but was actually able to make a little bit of noise towards the end of the season. Some are calling for the breakout, while some say he's a terrible football player. It's unlikely to see it happen this year, but Walford is a well rounded player and a breakout wouldn't be a shock."
  },
  {
    "Player": "Jordan Cameron MIA (8)",
    "BallersRank": 23,
    "ADP": 0,
    "Projected Pts.": 104.73,
    "Risk": 5.83,
    "Tier": "TIER 7",
    "Vid": "",
    "Notes": "Since Cameron's breakout season a few years ago, he hasn't come anywhere close to matching that type of fantasy output. In fact the last two years combined would still be worse than his big year. The physical tools are all there. Now Adam Gase comes to town, an offensive coach that likes to use the TE (think Julius Thomas and Martellus Bennet). He would only be a flier, but you could fly worse than on Cameron."
  },
  {
    "Player": "Ladarius Green PIT (8)",
    "BallersRank": 24,
    "ADP": 13.01,
    "Projected Pts.": 78.83,
    "Risk": 4.83,
    "Tier": "TIER 7",
    "Vid": "",
    "Notes": "Ladarius Green is now dealing with a very murky situation. It's reported that he is dealing with headaches still from a concussion last season. It's not good. It's hands off at this point and he could even be heading the IR."
  },
  {
    "Player": "Jared Cook GB (4)",
    "BallersRank": 25,
    "ADP": 13.09,
    "Projected Pts.": 96.5,
    "Risk": 5.03,
    "Tier": "TIER 7",
    "Vid": "",
    "Notes": "Jared Cook is a possible upside candidate this year at tight end now that he's made the move to the Packers. But be careful of your expectations. Aaron Rodgers hasn't used the tight end position very much since the departure of Jermichael Finley. Last year it took injuries to Jordy Nelson and Andrew Quarless PLUS a hail marry touchdown to make Richard Rodgers barely a tight end 1. Then there's the fact that Richard Rodgers is still there to split with Jared Cook."
  },
  {
    "Player": "Austin Seferian-Jenkins TB (6)",
    "BallersRank": 26,
    "ADP": 0,
    "Projected Pts.": 88,
    "Risk": 5.33,
    "Tier": "TIER 7",
    "Vid": "",
    "Notes": "ASJ has been a major disappointment to this point in his career. But we need to remember that his \"career\" has only been two seasons. Over the course of those two seasons, he's missed 16 total games. But great TEs don't usually show up until their third year in the league anyway, and you saw some dynamic plays with ASJ and Winston last year as he averaged 16.1 yards per reception. This is a true boom or bust candidate, but time is running out on him to stake claim to the Bucs primary TE position. However, if he plays a full 16 this year, he has the talent to be top 5 at the position."
  },
  {
    "Player": "Maxx Williams BAL (8)",
    "BallersRank": 27,
    "ADP": 0,
    "Projected Pts.": 91.43,
    "Risk": 5,
    "Tier": "TIER 7",
    "Vid": "",
    "Notes": "Williams was the first TE taken in his draft class. It didn't pan out for much last year. The Ravens decided to add veteran Ben Watson to their depth chart, making things very unclear for Maxx. He was drafted to be a pass catcher, he's in Marc Trestman's offense that is frequently friendly to the TE. The table is set, but unfortunately there's around 4 plates at that table"
  },
  {
    "Player": "Jimmy Graham SEA (5)",
    "BallersRank": 28,
    "ADP": 10.03,
    "Projected Pts.": 51.03,
    "Risk": 9.55,
    "Tier": "TIER 8",
    "Vid": "",
    "Notes": "Jimmy Graham was a fantasy all-star tight end for the Saints for several years. Last year, he went to the Seahawks and majorly disappointed before getting injured. Even when healthy he was a boom or bust weekly play which is not much different than your average tight end. What's worse is that when he left the team due to injury, their offense seemed to improve. But that was last year... so how about this year? Much, much worse. He's now coming off a devastating injury that says he probably can't return to form in 2016. Sure, they might say he's looking good but we heard the same thing with Victor Cruz last year and we know how well that worked out."
  },
  {
    "Player": "Richard Rodgers GB (4)",
    "BallersRank": 29,
    "ADP": 0,
    "Projected Pts.": 60.73,
    "Risk": 5.03,
    "Tier": "TIER 8",
    "Vid": "",
    "Notes": "Managed to swindle his way to being a TE1 last year. Mostly on the heels of touchdowns, and specifically a one legendary hailmary play that will haunt the dreams of Lions fans to eternity. His production was erratic at best. He is still young. But the Packers brought in Jared Cook during the offseason. It would be a shock to see Rodgers do much of anything for fantasy this year."
  },
  {
    "Player": "Benjamin Watson BAL (8)",
    "BallersRank": 30,
    "ADP": 0,
    "Projected Pts.": 0,
    "Risk": 4.53,
    "Tier": "TIER 9",
    "Vid": "",
    "Notes": "We love Benjamin Watson. He's a great dude, with a great story, and we're happy for him to have had the year he had with the Saints last year. Heck, we're even happy he was able to turn that into a new contract with the Ravens. But his fantasy value came from the system and the QB he had last year. At 35 years old, he's going to a team that has a young stud TE in Maxx Williams and serviceable TE \"Betty\" Crockett Gillmore. He'll be used to block and mentor the young guys, not to produce for fantasy owners. Draft him only as a good luck charm, not a player."
  },
  {
    "Player": "Vernon Davis WAS (9)",
    "BallersRank": 31,
    "ADP": 0,
    "Projected Pts.": 0,
    "Risk": 7.95,
    "Tier": "TIER 9",
    "Vid": "",
    "Notes": "The Washington insurance plan if something terrible happens to Jordan Reed and Niles Paul isn't able to fill in."
  },
  {
    "Player": "Larry Donnell NYG (8)",
    "BallersRank": 32,
    "ADP": 0,
    "Projected Pts.": 25.2,
    "Risk": 7.05,
    "Tier": "TIER 9",
    "Vid": "",
    "Notes": "Donnell is coming off a very serious neck injury. He often looks like an awkward teenager that is still getting used to his body after a big growth spurt. With the way Will Tye played, Donnell could find himself on the bench."
  },
  {
    "Player": "Zach Miller, FA",
    "BallersRank": 33,
    "ADP": 13.09,
    "Projected Pts.": 0,
    "Risk": 0,
    "Tier": "TIER 9",
    "Vid": "",
    "Notes": ""
  },
  {
    "Player": "Crockett Gillmore BAL (8)",
    "BallersRank": 34,
    "ADP": 0,
    "Projected Pts.": 0,
    "Risk": 6,
    "Tier": "TIER 9",
    "Vid": "",
    "Notes": "Gillmore has had multiple offseason surgeries. He had a decent year and was a useful spot starter for fantasy. But the Ravens have been proactive adding Ben Watson to the roster if Gillmore can't be ready for Week 1."
  },
  {
    "Player": "Jace Amaro NYJ (11)",
    "BallersRank": 35,
    "ADP": 0,
    "Projected Pts.": 0,
    "Risk": 5,
    "Tier": "TIER 9",
    "Vid": "",
    "Notes": ""
  },
  {
    "Player": "Owen Daniels, FA",
    "BallersRank": 36,
    "ADP": 0,
    "Projected Pts.": 0,
    "Risk": 0,
    "Tier": "TIER 9",
    "Vid": "",
    "Notes": "Owen Daniels proved last year that he isn't good anymore. Plus he doesn't have a team. That always hurts your fantasy value."
  },
  {
    "Player": "Jacob Tamme ATL (11)",
    "BallersRank": 37,
    "ADP": 0,
    "Projected Pts.": 0,
    "Risk": 4,
    "Tier": "TIER 9",
    "Vid": "",
    "Notes": ""
  },
  {
    "Player": "Josh Hill NO (5)",
    "BallersRank": 38,
    "ADP": 0,
    "Projected Pts.": 0,
    "Risk": 5,
    "Tier": "TIER 9",
    "Vid": "",
    "Notes": ""
  },
  {
    "Player": "Ryan Griffin HOU (9)",
    "BallersRank": 39,
    "ADP": 0,
    "Projected Pts.": 0,
    "Risk": 5,
    "Tier": "TIER 9",
    "Vid": "",
    "Notes": ""
  },
  {
    "Player": "Jesse James PIT (8)",
    "BallersRank": 40,
    "ADP": 0,
    "Projected Pts.": 0,
    "Risk": 4,
    "Tier": "TIER 9",
    "Vid": "",
    "Notes": ""
  },
  {
    "Player": "Hunter Henry SD (11)",
    "BallersRank": 41,
    "ADP": 0,
    "Projected Pts.": 21.67,
    "Risk": 6,
    "Tier": "TIER 9",
    "Vid": "",
    "Notes": ""
  },
  {
    "Player": "Austin Hooper ATL (11)",
    "BallersRank": 41,
    "ADP": 0,
    "Projected Pts.": 24.33,
    "Risk": 6,
    "Tier": "TIER 9",
    "Vid": "",
    "Notes": ""
  },
  {
    "Player": "Mychal Rivera OAK (10)",
    "BallersRank": 43,
    "ADP": 0,
    "Projected Pts.": 0,
    "Risk": 5,
    "Tier": "TIER 9",
    "Vid": "",
    "Notes": ""
  },
  {
    "Player": "Blake Bell SF (8)",
    "BallersRank": 44,
    "ADP": 0,
    "Projected Pts.": 0,
    "Risk": 0,
    "Tier": "TIER 9",
    "Vid": "",
    "Notes": ""
  },
  {
    "Player": "Darren Fells ARI (9)",
    "BallersRank": 45,
    "ADP": 0,
    "Projected Pts.": 0,
    "Risk": 0,
    "Tier": "TIER 9",
    "Vid": "",
    "Notes": ""
  },
  {
    "Player": "Brent Celek PHI (4)",
    "BallersRank": 46,
    "ADP": 0,
    "Projected Pts.": 0,
    "Risk": 0,
    "Tier": "TIER 9",
    "Vid": "",
    "Notes": ""
  },
  {
    "Player": "Jeff Cumberland SD (11)",
    "BallersRank": 47,
    "ADP": 0,
    "Projected Pts.": 0,
    "Risk": 0,
    "Tier": "TIER 9",
    "Vid": "",
    "Notes": ""
  },
  {
    "Player": "Lance Kendricks LA (8)",
    "BallersRank": 48,
    "ADP": 0,
    "Projected Pts.": 0,
    "Risk": 0,
    "Tier": "TIER 9",
    "Vid": "",
    "Notes": ""
  }
]